Repository: giellalt/corpus-sme
Catalog: tmx/eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=302_lang=davvi.html.tmx
Source language: sme
Languages: eng

source: Oktavuohta
eng: Contact information

source: Čoahkkin- ja dáhpáhusbálvalusat
eng: Sámi Cultural Centre Sajos

source: Sámekulturguovddáš Sajos
eng: Congresses and Events

source: 99870 Anár / Inari
eng: Marketing and Sales

source: Várremat ja márkanastin
eng: Cleaning

source: Doaibmalatnjafuolahus / Fáktameašttir
eng: Security / Maintenance / Information

source: Vuovdinrehkegat
eng: Information Desk Office
